; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v3 ?v2)
             (pred_3 ?v6 ?v10)
             (pred_6 ?v3 ?v10)
             (pred_11 ?v11 ?v3 )
	     (pred_8 ?v3)
             (pred_12 ?v4)
             (pred_10 ?v6)
             (pred_7 ?v10)
             (pred_4 ?v3)
             (pred_1 ?v6)
             (pred_9 ?v3)
             (pred_2 ))



(:action op_5
:parameters (?v8 ?v13 ?v5 ?v1)
:precondition (and (pred_12 ?v8) (pred_12 ?v13) (pred_10 ?v5) (pred_7 ?v1)
          (pred_5 ?v8 ?v13) (pred_3 ?v5 ?v1)
                   (pred_6 ?v13 ?v1) (pred_8 ?v8) 
                   (pred_4 ?v13) (pred_1 ?v5))
:effect (and  (pred_9 ?v13) (not (pred_4 ?v13))))


(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_12 ?v8) (pred_12 ?v12)
               (pred_8 ?v8) (pred_5 ?v8 ?v12) (pred_9 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v8))))

(:action op_4
:parameters (?v8 ?v5)
:precondition (and (pred_12 ?v8) (pred_10 ?v5) 
                  (pred_8 ?v8) (pred_11 ?v5 ?v8) (pred_2 ))
:effect (and (pred_1 ?v5)
   (not (pred_11 ?v5 ?v8)) (not (pred_2 ))))


(:action op_3
:parameters (?v8 ?v7 ?v9)
:precondition (and (pred_12 ?v8) (pred_10 ?v7) (pred_10 ?v9)
                  (pred_8 ?v8) (pred_1 ?v9) (pred_11 ?v7 ?v8))
:effect (and (pred_1 ?v7) (pred_11 ?v9 ?v8)
        (not (pred_1 ?v9)) (not (pred_11 ?v7 ?v8))))

(:action op_2
:parameters (?v8 ?v5)
:precondition (and (pred_12 ?v8) (pred_10 ?v5) 
                  (pred_8 ?v8) (pred_1 ?v5))
:effect (and (pred_2 ) (pred_11 ?v5 ?v8) (not (pred_1 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_29 obj_30 obj_16 obj_06 obj_04 obj_20 obj_08 obj_27 obj_24 obj_23 obj_18 obj_12 obj_03 obj_26 obj_02 obj_17 obj_19 obj_22 obj_05 obj_21 obj_07 obj_01 obj_10 obj_14 obj_09
    obj_11 obj_28
    obj_15 obj_25 obj_13
    )

    (:init
       (pred_2)

       (pred_12 obj_29)
       (pred_12 obj_30)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_12 obj_24)
       (pred_12 obj_23)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_03)
       (pred_12 obj_26)
       (pred_12 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_22)
       (pred_12 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_7 obj_11)
       (pred_7 obj_28)
       (pred_10 obj_15)
       (pred_10 obj_25)
       (pred_10 obj_13)

       (pred_5 obj_29 obj_20)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_30 obj_08)
       (pred_5 obj_30 obj_16)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_16 obj_27)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_30)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_04 obj_23)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_20 obj_18)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_20 obj_29)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_08 obj_27)
       (pred_5 obj_08 obj_30)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_27 obj_03)
       (pred_5 obj_27 obj_24)
       (pred_5 obj_27 obj_16)
       (pred_5 obj_27 obj_08)
       (pred_5 obj_24 obj_26)
       (pred_5 obj_24 obj_23)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_24 obj_27)
       (pred_5 obj_23 obj_02)
       (pred_5 obj_23 obj_04)
       (pred_5 obj_23 obj_24)
       (pred_5 obj_18 obj_17)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_20)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_03 obj_22)
       (pred_5 obj_03 obj_26)
       (pred_5 obj_03 obj_27)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_26 obj_05)
       (pred_5 obj_26 obj_02)
       (pred_5 obj_26 obj_24)
       (pred_5 obj_26 obj_03)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_02 obj_23)
       (pred_5 obj_02 obj_26)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_17 obj_19)
       (pred_5 obj_17 obj_18)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_19 obj_22)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_19 obj_17)
       (pred_5 obj_22 obj_10)
       (pred_5 obj_22 obj_05)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_22 obj_19)
       (pred_5 obj_05 obj_14)
       (pred_5 obj_05 obj_21)
       (pred_5 obj_05 obj_26)
       (pred_5 obj_05 obj_22)
       (pred_5 obj_21 obj_09)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_21 obj_05)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_07 obj_17)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_10 obj_14)
       (pred_5 obj_10 obj_22)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_05)
       (pred_5 obj_14 obj_10)
       (pred_5 obj_09 obj_21)
       (pred_5 obj_09 obj_14)
       (pred_4 obj_23)
       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_6  obj_23 obj_11)
       (pred_6  obj_17 obj_28)
       (pred_6  obj_14 obj_28)
       (pred_9 obj_29)
       (pred_9 obj_30)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_08)
       (pred_9 obj_27)
       (pred_9 obj_24)
       (pred_9 obj_18)
       (pred_9 obj_12)
       (pred_9 obj_03)
       (pred_9 obj_26)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_22)
       (pred_9 obj_05)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_10)
       (pred_9 obj_09)

       (pred_3  obj_15 obj_11)
       (pred_3  obj_25 obj_28)
       (pred_3  obj_13 obj_11)
       (pred_11 obj_15 obj_26)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_13 obj_27)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_11 obj_15 obj_22)
       (pred_11 obj_13 obj_19)
    ))
(:constraints
  (always (not (pred_8 obj_03)))
)
)

; plan
1. (op_1 obj_16 obj_27)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_27)
   goals met: 0 of 2
2. (op_4 obj_27 obj_13)
   deleted: (pred_11 obj_13 obj_27) (pred_2)
   added: (pred_1 obj_13)
   goals met: 0 of 2
3. (op_1 obj_27 obj_24)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_24)
   goals met: 0 of 2
4. (op_1 obj_24 obj_26)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_26)
   goals met: 0 of 2
5. (op_3 obj_26 obj_15 obj_13)
   deleted: (pred_1 obj_13) (pred_11 obj_15 obj_26)
   added: (pred_1 obj_15) (pred_11 obj_13 obj_26)
   goals met: 0 of 2
6. (op_1 obj_26 obj_05)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_05)
   goals met: 0 of 2
7. (op_1 obj_05 obj_22)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_22)
   goals met: 0 of 2
8. (op_2 obj_22 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_2) (pred_11 obj_15 obj_22)
   goals met: 1 of 2
9. (op_1 obj_22 obj_05)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_05)
   goals met: 1 of 2
10. (op_1 obj_05 obj_26)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_26)
   goals met: 1 of 2
11. (op_4 obj_26 obj_13)
   deleted: (pred_11 obj_13 obj_26) (pred_2)
   added: (pred_1 obj_13)
   goals met: 1 of 2
12. (op_1 obj_26 obj_05)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_05)
   goals met: 1 of 2
13. (op_1 obj_05 obj_22)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_22)
   goals met: 1 of 2
14. (op_1 obj_22 obj_19)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_19)
   goals met: 1 of 2
15. (op_2 obj_19 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_2) (pred_11 obj_13 obj_19)
   goals met: 2 of 2
